Revit 2024 API
MultiSegmentGrid.GetGridIds Method
 Get the element ids of the Grids that make up this MultiSegmentGrid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<ElementId> GetGridIds()
Visual Basic
Public Function GetGridIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetGridIds()
Return Value
 Element ids of Grids that make up this MultiSegmentGrid.
See Also
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace